[
    {
        "sentence_id": "25321",
        "screening": -3,
        "label": "-1",
        "text": "It is also true that this has been a situation on our borders back through a number of administrations."
    },
    {
        "sentence_id": "25323",
        "screening": -3,
        "label": "-1",
        "text": "I believe in the idea of amnesty for those who have put down roots and who have lived here even though sometime back they may have entered illegally."
    },
    {
        "sentence_id": "25325",
        "screening": -3,
        "label": "-1",
        "text": "We don't think that those people should be allowed to continue operating free."
    },
    {
        "sentence_id": "25326",
        "screening": -3,
        "label": "-1",
        "text": "And this was why the provisions that we had in with regard to sanctions, and so forth -- and I'm going to do everything I can, and all of us in the administration are, to join in again when Congress is back at it to get an immigration bill that will give us, once again, control of our borders."
    },
    {
    "sentence_id": "25340",
    "screening": -3,
    "label": "1",
    "text": "And we have been the safety valve, whether we wanted to or not, with the illegal entry here, in Mexico, where their population is increasing and they don't have an economy that can absorb them and provide the jobs."
    },
    {
    "sentence_id": "25344",
    "screening": -3,
    "label": "-1",
    "text": "And if we're going to find a permanent, fundamental answer to this, it goes to American economic and trade policies that permit these nations to have a chance to get on their own two feet and to get prosperity, so that they can have jobs for themselves and their people."
    },
    {
    "sentence_id": "25346",
    "screening": -3,
    "label": "1",
    "text": "These high interest rates -- real rates that have doubled under this administration -- have had the same effect on Mexico and so on, and the cost of repaying those debts is so enormous that it results in massive unemployment, hardship, and heartache."
    },
    {
    "sentence_id": "25350",
    "screening": -3,
    "label": "1",
    "text": "But with regard to these high interest rates, too, at least give us the recognition of the fact that when you left office, Mr. Mondale, they were 211/2 -- the prime rate."
    },
    {
    "sentence_id": "25351",
    "screening": -3,
    "label": "1",
    "text": "It's now 121/4, and I predict it'll be coming down a little more shortly."
    },
    {
    "sentence_id": "25352",
    "screening": -3,
    "label": "-1",
    "text": "So, we're trying to undo some of the things that your administration did."
    }
]